RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/include/cy_prot.h
*     <td>API enhancement based on usability feedback.</td>
*   </tr>
*   <tr>
*     <td>1.30.1</td>
*     <td>Snippet updated.</td>
*     <td>Old snippet outdated.</td>
*   </tr>
*   <tr>
*     <td>1.30</td>
*     <td>Defect in \ref Cy_Prot_GetPpuProgStruct() function due to faulty defines is fixed.</td>
*     <td>Defect fixing.</td>
*   </tr>
*   <tr>
*     <td rowspan="3">1.20</td>
*     <td>Flattened the organization of the driver source code into the single
*         source directory and the single include directory.</td>
*     <td>Driver library directory-structure simplification.</td>
*   </tr>
*   <tr>
*     <td>Added functions for CPUSS ver_2:
*         - \ref Cy_Prot_ConfigPpuProgMasterAtt()
*         - \ref Cy_Prot_ConfigPpuProgSlaveAddr()
*         - \ref Cy_Prot_ConfigPpuProgSlaveAtt()
*         - \ref Cy_Prot_EnablePpuProgSlaveRegion()
*         - \ref Cy_Prot_DisablePpuProgSlaveRegion()
*         - \ref Cy_Prot_ConfigPpuFixedMasterAtt()
*         - \ref Cy_Prot_ConfigPpuFixedSlaveAtt()
*     </td>
*     <td>Added support for CPUSS ver_2.</td>
*   </tr>
*   <tr>
*     <td>Added register access layer. Use register access macros instead
*         of direct register access using dereferenced pointers.</td>
*     <td>Makes register access device-independent, so that the PDL does
*         not need to be recompiled for each supported part number.</td>
*   </tr>
*   <tr>
*     <td rowspan="2">1.10</td>
*     <td>Added input parameter validation to the API functions.<br>
*     cy_en_prot_pcmask_t, cy_en_prot_subreg_t and cy_en_prot_pc_t
*     types are set to typedef enum</td>
*     <td>Improved debugging capability</td>
*   </tr>
*   <tr>
*     <td>Expanded documentation</td>
*     <td></td>
*   </tr>
*   <tr>
*     <td>1.0</td>
*     <td>Initial version</td>
*     <td></td>
*   </tr>
* </table>
*
* \defgroup group_prot_macros Macros
* \defgroup group_prot_functions Functions
* \{
*   \defgroup group_prot_functions_busmaster    Bus Master and PC Functions
*   \defgroup group_prot_functions_mpu          MPU Functions
*   \defgroup group_prot_functions_smpu         SMPU Functions
*   \defgroup group_prot_functions_ppu_prog_v2  PPU Programmable (PROG) v2 Functions
*   \defgroup group_prot_functions_ppu_fixed_v2 PPU Fixed (FIXED) v2 Functions
*   \defgroup group_prot_functions_ppu_prog     PPU Programmable (PROG) v1 Functions
*   \defgroup group_prot_functions_ppu_gr       PPU Group (GR) v1 Functions
*   \defgroup group_prot_functions_ppu_sl       PPU Slave (SL) v1 Functions
*   \defgroup group_prot_functions_ppu_rg       PPU Region (RG) v1 Functions
* \}
* \defgroup group_prot_data_structures Data Structures
* \defgroup group_prot_enums Enumerated Types
*/

#if !defined (CY_CY_PROT_PDL_H)
#define CY_CY_PROT_PDL_H

#include "cy_device.h"

#if defined (CY_IP_M4CPUSS) || defined (CY_IP_M7CPUSS)

#include <stdbool.h>
#include <stddef.h>
#include "cy_device_headers.h"
#include "cy_syslib.h"

#if defined(__cplusplus)
extern "C" {
#endif

/** \addtogroup group_prot_macros
* \{
*/

/** Driver major version */
#define CY_PROT_DRV_VERSION_MAJOR       1

/** Driver minor version */
#define CY_PROT_DRV_VERSION_MINOR       70

/** Prot driver ID */
#define CY_PROT_ID                      (CY_PDL_DRV_ID(0x30U))

/** \} group_prot_macros */

/**
* \addtogroup group_prot_enums
* \{
*/

/**
* Prot Driver error codes
*/
typedef enum
{
    CY_PROT_SUCCESS       = 0x00U,                                    /**< Returned successful */
    CY_PROT_BAD_PARAM     = CY_PROT_ID | CY_PDL_STATUS_ERROR | 0x01U, /**< Bad parameter was passed */
    CY_PROT_INVALID_STATE = CY_PROT_ID | CY_PDL_STATUS_ERROR | 0x02U, /**< The operation is not setup */
    CY_PROT_FAILURE       = CY_PROT_ID | CY_PDL_STATUS_ERROR | 0x03U, /**< The resource is locked */
    CY_PROT_UNAVAILABLE   = CY_PROT_ID | CY_PDL_STATUS_ERROR | 0x04U  /**< The resource is unavailable */
} cy_en_prot_status_t;

/**
* User/Privileged permission
*/
typedef enum
{
    CY_PROT_PERM_DISABLED = 0x00U, /**< Read, Write and Execute disabled */
    CY_PROT_PERM_R        = 0x01U, /**< Read enabled */
    CY_PROT_PERM_W        = 0x02U, /**< Write enabled */
    CY_PROT_PERM_RW       = 0x03U, /**< Read and Write enabled */
    CY_PROT_PERM_X        = 0x04U, /**< Execute enabled */
    CY_PROT_PERM_RX       = 0x05U, /**< Read and Execute enabled */
    CY_PROT_PERM_WX       = 0x06U, /**< Write and Execute enabled */
    CY_PROT_PERM_RWX      = 0x07U  /**< Read, Write and Execute enabled */
}cy_en_prot_perm_t;

/**
* Constants for memory region size setting.
* These may be useful for pre-processor-time tests.
*/
#define PROT_SIZE_4B_BIT_SHIFT      1U   /**< 4 bytes */
#define PROT_SIZE_8B_BIT_SHIFT      2U   /**< 8 bytes */
#define PROT_SIZE_16B_BIT_SHIFT     3U   /**< 16 bytes */
#define PROT_SIZE_32B_BIT_SHIFT     4U   /**< 32 bytes */
#define PROT_SIZE_64B_BIT_SHIFT     5U   /**< 64 bytes */
#define PROT_SIZE_128B_BIT_SHIFT    6U   /**< 128 bytes */
#define PROT_SIZE_256B_BIT_SHIFT    7U   /**< 256 bytes */
#define PROT_SIZE_512B_BIT_SHIFT    8U   /**< 512 bytes */

#define PROT_SIZE_1KB_BIT_SHIFT     9U   /**< 1 Kilobyte */
#define PROT_SIZE_2KB_BIT_SHIFT     10U  /**< 2 Kilobytes */
#define PROT_SIZE_4KB_BIT_SHIFT     11U  /**< 4 Kilobytes */
#define PROT_SIZE_8KB_BIT_SHIFT     12U  /**< 8 Kilobytes */
#define PROT_SIZE_16KB_BIT_SHIFT    13U  /**< 16 Kilobytes */
#define PROT_SIZE_32KB_BIT_SHIFT    14U  /**< 32 Kilobytes */
#define PROT_SIZE_64KB_BIT_SHIFT    15U  /**< 64 Kilobytes */
#define PROT_SIZE_128KB_BIT_SHIFT   16U  /**< 128 Kilobytes */
#define PROT_SIZE_256KB_BIT_SHIFT   17U  /**< 256 Kilobytes */
#define PROT_SIZE_512KB_BIT_SHIFT   18U  /**< 512 Kilobytes */

#define PROT_SIZE_1MB_BIT_SHIFT     19U  /**< 1 Megabyte */
#define PROT_SIZE_2MB_BIT_SHIFT     20U  /**< 2 Megabytes */
#define PROT_SIZE_4MB_BIT_SHIFT     21U  /**< 4 Megabytes */
#define PROT_SIZE_8MB_BIT_SHIFT     22U  /**< 8 Megabytes */
#define PROT_SIZE_16MB_BIT_SHIFT    23U  /**< 16 Megabytes */
#define PROT_SIZE_32MB_BIT_SHIFT    24U  /**< 32 Megabytes */
#define PROT_SIZE_64MB_BIT_SHIFT    25U  /**< 64 Megabytes */
#define PROT_SIZE_128MB_BIT_SHIFT   26U  /**< 128 Megabytes */
#define PROT_SIZE_256MB_BIT_SHIFT   27U  /**< 256 Megabytes */
#define PROT_SIZE_512MB_BIT_SHIFT   28U  /**< 512 Megabytes */

#define PROT_SIZE_1GB_BIT_SHIFT     29U  /**< 1 Gigabyte */
#define PROT_SIZE_2GB_BIT_SHIFT     30U  /**< 2 Gigabytes */
#define PROT_SIZE_4GB_BIT_SHIFT     31U  /**< 4 Gigabytes */

/**
* Memory region size
*/
typedef enum
{
    CY_PROT_SIZE_4B    = PROT_SIZE_4B_BIT_SHIFT,    /**< 4 bytes */
    CY_PROT_SIZE_8B    = PROT_SIZE_8B_BIT_SHIFT,    /**< 8 bytes */
    CY_PROT_SIZE_16B   = PROT_SIZE_16B_BIT_SHIFT,   /**< 16 bytes */
    CY_PROT_SIZE_32B   = PROT_SIZE_32B_BIT_SHIFT,   /**< 32 bytes */
    CY_PROT_SIZE_64B   = PROT_SIZE_64B_BIT_SHIFT,   /**< 64 bytes */
    CY_PROT_SIZE_128B  = PROT_SIZE_128B_BIT_SHIFT,  /**< 128 bytes */
    CY_PROT_SIZE_256B  = PROT_SIZE_256B_BIT_SHIFT,  /**< 256 bytes */
    CY_PROT_SIZE_512B  = PROT_SIZE_512B_BIT_SHIFT,  /**< 512 bytes */
    CY_PROT_SIZE_1KB   = PROT_SIZE_1KB_BIT_SHIFT,   /**< 1 Kilobyte */
    CY_PROT_SIZE_2KB   = PROT_SIZE_2KB_BIT_SHIFT,   /**< 2 Kilobytes */
    CY_PROT_SIZE_4KB   = PROT_SIZE_4KB_BIT_SHIFT,   /**< 4 Kilobytes */
    CY_PROT_SIZE_8KB   = PROT_SIZE_8KB_BIT_SHIFT,   /**< 8 Kilobytes */
    CY_PROT_SIZE_16KB  = PROT_SIZE_16KB_BIT_SHIFT,  /**< 16 Kilobytes */
    CY_PROT_SIZE_32KB  = PROT_SIZE_32KB_BIT_SHIFT,  /**< 32 Kilobytes */
    CY_PROT_SIZE_64KB  = PROT_SIZE_64KB_BIT_SHIFT,  /**< 64 Kilobytes */
    CY_PROT_SIZE_128KB = PROT_SIZE_128KB_BIT_SHIFT, /**< 128 Kilobytes */
    CY_PROT_SIZE_256KB = PROT_SIZE_256KB_BIT_SHIFT, /**< 256 Kilobytes */
    CY_PROT_SIZE_512KB = PROT_SIZE_512KB_BIT_SHIFT, /**< 512 Kilobytes */
    CY_PROT_SIZE_1MB   = PROT_SIZE_1MB_BIT_SHIFT,   /**< 1 Megabyte */
    CY_PROT_SIZE_2MB   = PROT_SIZE_2MB_BIT_SHIFT,   /**< 2 Megabytes */
    CY_PROT_SIZE_4MB   = PROT_SIZE_4MB_BIT_SHIFT,   /**< 4 Megabytes */
    CY_PROT_SIZE_8MB   = PROT_SIZE_8MB_BIT_SHIFT,   /**< 8 Megabytes */
    CY_PROT_SIZE_16MB  = PROT_SIZE_16MB_BIT_SHIFT,  /**< 16 Megabytes */
    CY_PROT_SIZE_32MB  = PROT_SIZE_32MB_BIT_SHIFT,  /**< 32 Megabytes */
    CY_PROT_SIZE_64MB  = PROT_SIZE_64MB_BIT_SHIFT,  /**< 64 Megabytes */
    CY_PROT_SIZE_128MB = PROT_SIZE_128MB_BIT_SHIFT, /**< 128 Megabytes */
    CY_PROT_SIZE_256MB = PROT_SIZE_256MB_BIT_SHIFT, /**< 256 Megabytes */
    CY_PROT_SIZE_512MB = PROT_SIZE_512MB_BIT_SHIFT, /**< 512 Megabytes */
    CY_PROT_SIZE_1GB   = PROT_SIZE_1GB_BIT_SHIFT,   /**< 1 Gigabyte */
    CY_PROT_SIZE_2GB   = PROT_SIZE_2GB_BIT_SHIFT,   /**< 2 Gigabytes */
    CY_PROT_SIZE_4GB   = PROT_SIZE_4GB_BIT_SHIFT    /**< 4 Gigabytes */
}cy_en_prot_size_t;

/**
* Protection Context (PC)
*/
enum cy_en_prot_pc_t
{
    CY_PROT_PC1  = 1U,  /**< PC = 1 */
    CY_PROT_PC2  = 2U,  /**< PC = 2 */
    CY_PROT_PC3  = 3U,  /**< PC = 3 */
    CY_PROT_PC4  = 4U,  /**< PC = 4 */
    CY_PROT_PC5  = 5U,  /**< PC = 5 */
    CY_PROT_PC6  = 6U,  /**< PC = 6 */
    CY_PROT_PC7  = 7U,  /**< PC = 7 */
    CY_PROT_PC8  = 8U,  /**< PC = 8 */
    CY_PROT_PC9  = 9U,  /**< PC = 9 */
    CY_PROT_PC10 = 10U, /**< PC = 10 */
    CY_PROT_PC11 = 11U, /**< PC = 11 */
    CY_PROT_PC12 = 12U, /**< PC = 12 */
    CY_PROT_PC13 = 13U, /**< PC = 13 */
    CY_PROT_PC14 = 14U, /**< PC = 14 */
    CY_PROT_PC15 = 15U  /**< PC = 15 */
};

/**
* Subregion disable (0-7)
*/
enum cy_en_prot_subreg_t
{
    CY_PROT_SUBREGION_DIS0 = 0x01U,  /**< Disable subregion 0 */
    CY_PROT_SUBREGION_DIS1 = 0x02U,  /**< Disable subregion 1 */
    CY_PROT_SUBREGION_DIS2 = 0x04U,  /**< Disable subregion 2 */
    CY_PROT_SUBREGION_DIS3 = 0x08U,  /**< Disable subregion 3 */
    CY_PROT_SUBREGION_DIS4 = 0x10U,  /**< Disable subregion 4 */
    CY_PROT_SUBREGION_DIS5 = 0x20U,  /**< Disable subregion 5 */
    CY_PROT_SUBREGION_DIS6 = 0x40U,  /**< Disable subregion 6 */
    CY_PROT_SUBREGION_DIS7 = 0x80U   /**< Disable subregion 7 */
};

/**
* Protection context mask (PC_MASK)
*/
enum cy_en_prot_pcmask_t
{
    CY_PROT_PCMASK1  = 0x0001U,  /**< Mask to allow PC = 1 */
    CY_PROT_PCMASK2  = 0x0002U,  /**< Mask to allow PC = 2 */
    CY_PROT_PCMASK3  = 0x0004U,  /**< Mask to allow PC = 3 */
    CY_PROT_PCMASK4  = 0x0008U,  /**< Mask to allow PC = 4 */
    CY_PROT_PCMASK5  = 0x0010U,  /**< Mask to allow PC = 5 */
    CY_PROT_PCMASK6  = 0x0020U,  /**< Mask to allow PC = 6 */
    CY_PROT_PCMASK7  = 0x0040U,  /**< Mask to allow PC = 7 */
    CY_PROT_PCMASK8  = 0x0080U,  /**< Mask to allow PC = 8 */
    CY_PROT_PCMASK9  = 0x0100U,  /**< Mask to allow PC = 9 */
    CY_PROT_PCMASK10 = 0x0200U,  /**< Mask to allow PC = 10 */
    CY_PROT_PCMASK11 = 0x0400U,  /**< Mask to allow PC = 11 */
    CY_PROT_PCMASK12 = 0x0800U,  /**< Mask to allow PC = 12 */
    CY_PROT_PCMASK13 = 0x1000U,  /**< Mask to allow PC = 13 */
    CY_PROT_PCMASK14 = 0x2000U,  /**< Mask to allow PC = 14 */
    CY_PROT_PCMASK15 = 0x4000U   /**< Mask to allow PC = 15 */
};

/**
* Request mode to get the SMPU or programmed PU structure
*/
typedef enum
{
    CY_PROT_REQMODE_HIGHPRIOR = 0U,    /**< Request mode to return PU structure with highest priority */
    CY_PROT_REQMODE_LOWPRIOR  = 1U,     /**< Request mode to return PU structure with lowest priority */
    CY_PROT_REQMODE_INDEX     = 2U       /**< Request mode to return PU structure with specific index */
}cy_en_prot_req_mode_t;

/** \} group_prot_enums */


